In [2]:
#pandas 
#uses of pandas
#Data cleaning, normalization and transformation
#designed for working with tabular or heterogeneous data(diverse in nature can consists of different types,formats,structures and sources)

In [3]:
import pandas as pd
import numpy as np

In [4]:
#series - A series of data (1 dimensional)
#Dataframes - Tabular data (2 dimensional)

In [5]:
marks = pd.Series([80,70,60])

In [6]:
marks

0    80
1    70
2    60
dtype: int64

In [7]:
marks[1]

70

In [8]:
#specifying indexes

In [9]:
marks = pd.Series([80,70,90], index=['ali','ahmed','sarim'])

In [10]:
marks['ali']

80

In [11]:
#datatypes

In [12]:
age = pd.Series([22,21,20],index=['ali','ahmed','sarim'],dtype='float')

In [13]:
age

ali      22.0
ahmed    21.0
sarim    20.0
dtype: float64

In [14]:
#some conditions

In [15]:
age[age>20]#filtering

ali      22.0
ahmed    21.0
dtype: float64

In [16]:
age[['sarim','ali']] #fancy indexing

sarim    20.0
ali      22.0
dtype: float64

In [17]:
age['ahmed'] = 22#changing value

In [18]:
#Creating series using dictionary

In [19]:
age = pd.Series({'ali':23,'ahmed':22,'sarim':21})#key will become index and value will become the data

In [20]:
age

ali      23
ahmed    22
sarim    21
dtype: int64

In [21]:
pd.isnull(age)

ali      False
ahmed    False
sarim    False
dtype: bool

In [22]:
age.mean()

22.0

In [23]:
age1 = pd.Series([25,26],index=['sarim','ali'])

In [24]:
age+age1 #Adding data of two series

ahmed     NaN
ali      49.0
sarim    46.0
dtype: float64

In [25]:
#Dataframes

In [26]:
students = pd.DataFrame ({
    'names':['sarim','ahmed','ali'],
    'age':[20,21,23],
    'cgpa':[3.6,3.5,3.8],
    'address':['gulshan','nazimabad','gulzar e hijri']
})

In [27]:
students

   names  age  cgpa         address
0  sarim   20   3.6         gulshan
1  ahmed   21   3.5       nazimabad
2    ali   23   3.8  gulzar e hijri

In [28]:
students.columns

Index(['names', 'age', 'cgpa', 'address'], dtype='object')

In [29]:
students['names']

0    sarim
1    ahmed
2      ali
Name: names, dtype: object

In [30]:
students[['names','cgpa','address']]

   names  cgpa         address
0  sarim   3.6         gulshan
1  ahmed   3.5       nazimabad
2    ali   3.8  gulzar e hijri

In [31]:
students[students['age']>20] #Students with age greater than 20 filtering

   names  age  cgpa         address
1  ahmed   21   3.5       nazimabad
2    ali   23   3.8  gulzar e hijri

In [32]:
students.age

0    20
1    21
2    23
Name: age, dtype: int64

In [33]:
students.names

0    sarim
1    ahmed
2      ali
Name: names, dtype: object

In [34]:
students['semester'] =  np.arange(1,4)

In [35]:
students

   names  age  cgpa         address  semester
0  sarim   20   3.6         gulshan         1
1  ahmed   21   3.5       nazimabad         2
2    ali   23   3.8  gulzar e hijri         3

In [36]:
students.loc[2]

names                  ali
age                     23
cgpa                   3.8
address     gulzar e hijri
semester                 3
Name: 2, dtype: object

In [37]:
students.iloc[2]

names                  ali
age                     23
cgpa                   3.8
address     gulzar e hijri
semester                 3
Name: 2, dtype: object

In [38]:
students

   names  age  cgpa         address  semester
0  sarim   20   3.6         gulshan         1
1  ahmed   21   3.5       nazimabad         2
2    ali   23   3.8  gulzar e hijri         3

In [39]:
students.index=["s1","s2","s3"]

In [40]:
students

    names  age  cgpa         address  semester
s1  sarim   20   3.6         gulshan         1
s2  ahmed   21   3.5       nazimabad         2
s3    ali   23   3.8  gulzar e hijri         3

In [41]:
students.loc[["s1","s2"],["names","age"]]# searching with row and column names

    names  age
s1  sarim   20
s2  ahmed   21

In [42]:
students.iloc[[1,2],[4,3]]# searching with row and column indexes

    semester         address
s2         2       nazimabad
s3         3  gulzar e hijri

In [43]:
students.values

array([['sarim', 20, 3.6, 'gulshan', 1],
       ['ahmed', 21, 3.5, 'nazimabad', 2],
       ['ali', 23, 3.8, 'gulzar e hijri', 3]], dtype=object)

In [51]:
students.drop("s1",axis=0)#removing specific row

    names  age  cgpa         address  semester
s2  ahmed   21   3.5       nazimabad         2
s3    ali   23   3.8  gulzar e hijri         3

In [54]:
students.drop("names",axis=1)#removing specific column

    age  cgpa         address  semester
s1   20   3.6         gulshan         1
s2   21   3.5       nazimabad         2
s3   23   3.8  gulzar e hijri         3

In [59]:
students.values
arr = np.array([['sarim', 20, 3.6, 'gulshan', 1],
       ['ahmed', 21, 3.5, 'nazimabad', 2],
       ['ali', 23, 3.8, 'gulzar e hijri', 3]])

In [65]:
df = pd.DataFrame(arr,columns=["names","age","cgpa","address","semester"],index=["s1","s2","s3"]) #assigning names to columns and rows

In [63]:
#slicing

In [67]:
df.iloc[0:3:2]#start,end,step

    names age cgpa         address semester
s1  sarim  20  3.6         gulshan        1
s3    ali  23  3.8  gulzar e hijri        3

In [69]:
df.iloc[0:3:2]["semester"]# accessing specific rows and column by slicing

s1    1
s3    3
Name: semester, dtype: object

In [70]:
df.loc[:,"names":"address"]

    names age cgpa         address
s1  sarim  20  3.6         gulshan
s2  ahmed  21  3.5       nazimabad
s3    ali  23  3.8  gulzar e hijri

In [71]:
#Apply function

In [90]:
def age_check(Age):
    if(Age <= 20):
        return "under 20 or 20"
    else:
        return "over 20"

In [91]:
df['age']=df['age'].astype(int)

In [92]:
df['age_category'] = df['age'].apply(age_check)

In [93]:
df

    names  age cgpa         address semester    age_category
s1  sarim   20  3.6         gulshan        1  under 20 or 20
s2  ahmed   21  3.5       nazimabad        2         over 20
s3    ali   23  3.8  gulzar e hijri        3         over 20

In [94]:
#lambda function

In [97]:
age_checker = lambda age: "over 20" if age > 20 else "under 20 or 20"

In [98]:
df['age_category2'] = df['age'].apply(age_checker)

In [99]:
df

    names  age cgpa         address semester    age_category   age_category2
s1  sarim   20  3.6         gulshan        1  under 20 or 20  under 20 or 20
s2  ahmed   21  3.5       nazimabad        2         over 20         over 20
s3    ali   23  3.8  gulzar e hijri        3         over 20         over 20

In [100]:
employee = pd.DataFrame({
    "salary":[1000,2000,3000],
    "name":["sarim","ahmed","moosa"]
})

In [101]:
employee

   salary   name
0    1000  sarim
1    2000  ahmed
2    3000  moosa

In [104]:
employee['increment']=employee['salary'].apply(lambda salary:50 if salary <= 1000 else 25)

In [105]:
employee

   salary   name  increment
0    1000  sarim         50
1    2000  ahmed         25
2    3000  moosa         25